import sys
sys.path.append('../')
import utils
import cv2

def main():
    img = cv2.imread("./image/frame_ivus.png",0)
        
    # quiz 1.1 เพิ่มความสว่าง
    img_1 = utils.power_gamma(0.5,img)
    # utils.cv_show(img_1)
    cv2.imwrite('./out/frame_ivus_quiz_1_1.png', img_1)
    
    # quiz 1.2 ลดเงาจากแสงเยอะ
    img_2 = utils.power_gamma(4.0,img)
    
    # utils.cv_show(img_2)
    cv2.imwrite('./out/frame_ivus_quiz_1_2.png', img_2)
    
    # case 1 เอารูปต้นฉบับมาหาขอบ
    img_case_1 = utils.edge_operator_meth(img,2)
    utils.cv_show/(img_case_1)
    cv2.imwrite('./out/frame_ivus_case_1.png', img_case_1)

    # case 2 เอารูปจากต้นฉบับ มาทำ power gamma,medianBlur แล้วหาขอบ
    # img_case_2 = utils.edge_operator_meth(img,2)
    img_case_2 = utils.power_gamma(0.5,img)
    img_case_2 = utils.avg_blur(img_case_2,3)
    img_case_2 = utils.edge_operator_meth(img_case_2,2)
    # utils.cv_show(img_case_2)
    cv2.imwrite('./out/frame_ivus_case_2.png', img_case_2)    
    
    #concat result
    img_row_1 = cv2.hconcat([img,img_1])
    img_row_2 = cv2.hconcat([img,img_2])
    img_row_3 = cv2.hconcat([img,img_case_1])
    img_row_4 = cv2.hconcat([img,img_case_2])
    
    final_image = cv2.vconcat([img_row_1,img_row_2,img_row_3,img_row_4])
    # utils.cv_show(final_image)
     
    cv2.imwrite('./out/frame_ivus_quiz_1_1_concat.png', img_row_1)
    cv2.imwrite('./out/frame_ivus_quiz_1_2_concat.png', img_row_2)
    cv2.imwrite('./out/frame_ivus_case_1concat.png', img_row_3)
    cv2.imwrite('./out/frame_ivus_case_2concat.png', img_row_4)
    cv2.imwrite('./out/frame_ivus_final.png', final_image)
    
if __name__ == '__main__':
    main()


# ข้อที่ 1.1 
# ให้เพิ่มความสว่างของรูปภาพ โดยการใช้ power gamma 
# ในการปรับปรุง ถ้าค่า gamma < 1 ภาพจะสว่างขึ้น เป็นการยกกำลัง 
# ด้วยเลขที่น้อยกว่า 1 จะทำให้ค่าเดิมเพิ่มขึ้น ถ้า gamma มากกว่า 1 
# ภาพจะจะมืดลงเพราะว่า เลขยกกำลังมากกว่า 1 จะทำให้น้อยกว่าค่าเดิม 
# จะปรับภาพให้สว่างหรือมืดก็ขึ้นอยู่กับค่า gamma 
# ผลลัพท์ของข้อนี้จะได้ภาพที่สว่างขึ้นจากรูปเดิมเพราะว่าเรากำหนดค่า gamma ให้น้อยกว่า 1 

#ข้อ 1.2 เหมือนกับข้อ 1.1 แต่จะทำให้ภาพลดเงาจากแสงของรูปต้นฉบับ 
# เลยต้องเพิ่มค่า gamma ให้มากกว่า 1 ผลลัพท์ที่ได้จะ
# ได้รูปภาพที่มืดมองเห็นส่วนที่เป็นวงแหวนได้ชัดขึ้นเพราะลดเงารูปภาพไป

# case 1 (ทำเพิ่ม) 
# อ่านภาพรูปต้นฉบับแล้วหาขอบเลย การตรวจจับขอบ edge detection 
# เป็นการระบุจุดรอยต่อของวัตถุ ดูได้จากความแตกต่างของค่าแสง 
# เป็นการเปลี่ยนแปลงค่าความเข้มแสงแบบรวดเร็ว โดยการหาความชันของภาพในแนวนอนและแนวตั้ง 
# แล้วนำมารวมกันเพื่อหาขนาดของขอบ 
# การเปลี่ยนแปลงของแสงในแนวนอน gx 
# ค่าจากซ้ายไปขวาจะเปลี่ยนจาก -1 0 1 (และมีค่า k กำหนดความสำคัญของพิกเซลตรงกลาง) 
# gy เป็นการเปลี่ยนแปลงของแสงในแนวตั้ง ค่าจากบนลงล่าง 1 0 -1 (และมีค่า k กำหนดความสำคัญของพิกเซลตรงกลาง) 
# ถ้า k = 2 การเปลี่ยนแปลงของแสงที่เกิดขึ้นในพิกเซลตรงกลางเป็น 2
# เท่าจะเรียกว่า(Sobel Operator) ช่วยตรวจจับขอบได้แม่นยำขึ้น 
# แต่ถ้า k = 1 น้ำหนักในส่วนตรงกลางจะเท่ากันหมด เรียกว่า (Prewitt Operator) 
# ร้าง mask แล้วก็วนลูป ที่ละจุดเพื่อหาค่า gx และ gy และนำค่าทั้งสองมารวมกัน 
# แล้วจะได้ขนาดของขอบพิกเซลนั้นๆ แล้วก็มาตรวจสอบด้วยว่าถ้าค่ามากกว่า > 255 
# จุดพิกเซลตรงนั้นจะเป็นสีขาวครับ ผลลัพท์ของ case 1 
# เมื่อเทียบกับต้นฉบับจะได้รูปที่มีรายละเอียดที่เป็นเส้นๆขาว 
# ขอบวงนอกดูจางๆเส้นไม่ต่อเนื่องเส้นขาดบ้างแต่รายละเอียดข้างในค่อนข้างเห็นชัด


# case 2 (ทำเพิ่ม) 
# ส่วนเคสนี้จะเริ่มจากการทำ normalize ก่อนเพื่อทำให้ค่าเป็น 0 - 1 
# แล้วส่งไปที่ power gamma การทำ power gamma 
# ของรูปที่มืดใช้ค่า gamma ที่มีค่า น้อยกว่า 1 จำเป็นต้อง 
# normalized ให้อยู่ในช่วง 0,1 แล้วยกกำลังด้วยค่า gamma 
# เพื่อดันค่า pixel ที่มืดให้สว่างขึ้น แล้วคูณด้วยค่า c คือการแปลงค่ากลับเป็นขนามรูปเดิม 
# ให้อยู่ในช่วง 0 - 255 จะได้รูปภาพที่ชัดมากขึ้นและเห็นรายละเอียดที่วัตถุที่อยู่ในเงามืด 
# หลังจากนั้นก็ส่งให้ avg blur เพื่อเบลอรูปภาพ หลัการทำงานคือจะสร้าง mask ขนาดเลขคู่ 
# เป็นการแทนที่พิกเซลแต่ละจุดด้วยค่าเฉลี่ยของพิกเซลข้างรวมจุดของตัวเองด้วย และวนลูปทำ 
# จะได้รูปที่เบลอตามขนาดของ mask หลังจากนั้นก็ส่งไปที่ edge detection 
# เพื่อหาขอบเหมือน case1 ผลลัพท์ที่ได้คือ เทียบกับภาพต้นฉบับแล้ว 
# จะได้ขอบนนอกที่เกือบจะสมบูรณ์วงกลมสวยงามขอบมีขนาดที่ใหญ่กว่ารูปใน case 1 
# แต่รายละเอียดภายในอาจจะความละเอียดน้อยกว่ารูปที่ case 1 